package models;

/**
 * Перечисление цветов.
 * <p>
 * Используется для хранения цвета глаз и цвета волос объекта
 * {@link Person}.
 * </p>
 *
 * <p>
 * Содержит набор допустимых цветовых значений.
 * </p>
 *
 * @author Виктория Родина
 */
public enum Color {

    /**
     * Зелёный цвет.
     */
    GREEN,

    /**
     * Красный цвет.
     */
    RED,

    /**
     * Оранжевый цвет.
     */
    ORANGE,

    /**
     * Белый цвет.
     */
    WHITE,

    /**
     * Чёрный цвет.
     */
    BLACK,

    /**
     * Жёлтый цвет.
     */
    YELLOW
}